---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofUptoLevelOffsetParam
source: html/3da75f23-fcf5-28bb-fcc1-7bdb6886342a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofUptoLevelOffsetParam Property

"Cutoff Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofUptoLevelOffsetParam { get; }
```